## Plan Result (prod-backendappgateway)




<pre><code>Plan: 3 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * module.backendappgateway.azurerm_application_gateway.ag[0]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0]
  * module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[1]




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.backendappgateway.data.azurerm_monitor_diagnostic_categories.diagnostic_categories will be read during apply
  # (config refers to values not yet known)
 <= data "azurerm_monitor_diagnostic_categories" "diagnostic_categories" {
      + id          = (known after apply)
      + logs        = (known after apply)
      + metrics     = (known after apply)
      + resource_id = (known after apply)

      + timeouts {
          + read = (known after apply)
        }
    }

  # module.backendappgateway.azurerm_application_gateway.ag[0] will be created
  + resource "azurerm_application_gateway" "ag" {
      + id                  = (known after apply)
      + location            = "uksouth"
      + name                = "cft-aks00-prod-agw"
      + resource_group_name = "cft-prod-network-rg"
      + tags                = {
          + "application"  = "core"
          + "builtFrom"    = "hmcts/azure-platform-terraform"
          + "businessArea" = "CFT"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + zones               = [
          + "1",
          + "2",
          + "3",
        ]

      + autoscale_configuration {
          + max_capacity = 10
          + min_capacity = 2
        }

      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "draft-store-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "cmc-pdf-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "rpe-pdf-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "rpe-service-auth-provider"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "camunda-bpm"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "camunda-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "camunda-optimize"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "probate-business-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "probate-orchestrator-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "probate-submit-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "probate-back-office"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "pcq-backend"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "lau-case-backend"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "lau-idam-backend"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "ia-case-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "ia-case-notifications-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "ia-case-documents-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "ia-timed-event-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "ia-home-office-integration-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "ia-case-payments-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "ia-case-access-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "div-emca"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "div-fps"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "div-dgs"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "div-cms"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "div-cos"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "div-hm"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "div-cfs"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "finrem-ns"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "finrem-ps"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "finrem-emca"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "finrem-dgcs"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "finrem-cos"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "em-anno"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "em-npa"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "em-stitching"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "em-ccd-orchestrator"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "em-icp"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "em-hrs-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "em-hrs-ingestor"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "dg-docassembly"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "dm-store"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "sscs-tribunals-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "sscs-evidence-share"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "sscs-bulk-scan"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "sscs-ccd-callback-orchestrator"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "sscs-tya-notif"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "fpl-case-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "payment-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "fees-register-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "ccpay-refunds-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "ethos-repl-docmosis-backend"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "ethos-ecm-consumer"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "ccd-data-store-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "ccd-definition-store-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "ccd-user-profile-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "ccd-case-print-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "ccd-case-activity-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "ccd-admin-web"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "ccd-message-publisher"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "ccd-case-document-am-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "aac-manage-case-assignment"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "cpo-case-payment-orders-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "bar-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "rd-professional-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "rd-user-profile-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "rd-profile-sync"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "rd-judicial-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "rd-location-ref-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "rd-caseworker-ref-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "rd-commondata-api"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "am-role-assignment-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "am-org-role-mapping-service"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "bulk-scan-processor"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "bulk-scan-orchestrator"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "bulk-scan-payment-processor"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.250",
              + "10.13.31.250",
            ]
          + name         = "reform-scan-blob-router"
        }
      + backend_address_pool {
          + id           = (known after apply)
          + ip_addresses = [
              + "10.13.15.2

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

ttp_settings_name = "rd-caseworker-ref-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rd-caseworker-ref-api"
          + id                         = (known after apply)
          + name                       = "rd-caseworker-ref-api"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rd-commondata-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rd-commondata-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rd-commondata-api"
          + id                         = (known after apply)
          + name                       = "rd-commondata-api"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rd-judicial-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rd-judicial-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rd-judicial-api"
          + id                         = (known after apply)
          + name                       = "rd-judicial-api"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rd-location-ref-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rd-location-ref-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rd-location-ref-api"
          + id                         = (known after apply)
          + name                       = "rd-location-ref-api"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rd-professional-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rd-professional-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rd-professional-api"
          + id                         = (known after apply)
          + name                       = "rd-professional-api"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rd-profile-sync"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rd-profile-sync"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rd-profile-sync"
          + id                         = (known after apply)
          + name                       = "rd-profile-sync"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rd-user-profile-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rd-user-profile-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rd-user-profile-api"
          + id                         = (known after apply)
          + name                       = "rd-user-profile-api"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "reform-scan-blob-router"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "reform-scan-blob-router"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "reform-scan-blob-router"
          + id                         = (known after apply)
          + name                       = "reform-scan-blob-router"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "reform-scan-notification-service"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "reform-scan-notification-service"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "reform-scan-notification-service"
          + id                         = (known after apply)
          + name                       = "reform-scan-notification-service"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rpe-pdf-service"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rpe-pdf-service"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rpe-pdf-service"
          + id                         = (known after apply)
          + name                       = "rpe-pdf-service"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rpe-send-letter-service"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rpe-send-letter-service"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rpe-send-letter-service"
          + id                         = (known after apply)
          + name                       = "rpe-send-letter-service"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "rpe-service-auth-provider"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "rpe-service-auth-provider"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "rpe-service-auth-provider"
          + id                         = (known after apply)
          + name                       = "rpe-service-auth-provider"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "sscs-bulk-scan"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "sscs-bulk-scan"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "sscs-bulk-scan"
          + id                         = (known after apply)
          + name                       = "sscs-bulk-scan"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "sscs-ccd-callback-orchestrator"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "sscs-ccd-callback-orchestrator"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "sscs-ccd-callback-orchestrator"
          + id                         = (known after apply)
          + name                       = "sscs-ccd-callback-orchestrator"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "sscs-evidence-share"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "sscs-evidence-share"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "sscs-evidence-share"
          + id                         = (known after apply)
          + name                       = "sscs-evidence-share"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "sscs-tribunals-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "sscs-tribunals-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "sscs-tribunals-api"
          + id                         = (known after apply)
          + name                       = "sscs-tribunals-api"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "sscs-tya-notif"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "sscs-tya-notif"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "sscs-tya-notif"
          + id                         = (known after apply)
          + name                       = "sscs-tya-notif"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "wa-case-event-handler"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "wa-case-event-handler"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "wa-case-event-handler"
          + id                         = (known after apply)
          + name                       = "wa-case-event-handler"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "wa-task-management-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "wa-task-management-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "wa-task-management-api"
          + id                         = (known after apply)
          + name                       = "wa-task-management-api"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "wa-task-monitor"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "wa-task-monitor"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "wa-task-monitor"
          + id                         = (known after apply)
          + name                       = "wa-task-monitor"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "wa-workflow-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "wa-workflow-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "wa-workflow-api"
          + id                         = (known after apply)
          + name                       = "wa-workflow-api"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "xui-activity-tracker-api"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "xui-activity-tracker-api"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "xui-activity-tracker-api"
          + id                         = (known after apply)
          + name                       = "xui-activity-tracker-api"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }
      + request_routing_rule {
          + backend_address_pool_id    = (known after apply)
          + backend_address_pool_name  = "xui-terms-and-conditions"
          + backend_http_settings_id   = (known after apply)
          + backend_http_settings_name = "xui-terms-and-conditions"
          + http_listener_id           = (known after apply)
          + http_listener_name         = "xui-terms-and-conditions"
          + id                         = (known after apply)
          + name                       = "xui-terms-and-conditions"
          + redirect_configuration_id  = (known after apply)
          + rewrite_rule_set_id        = (known after apply)
          + rule_type                  = "Basic"
          + url_path_map_id            = (known after apply)
        }

      + sku {
          + name = "Standard_v2"
          + tier = "Standard_v2"
        }

      + ssl_certificate {
          + id                  = (known after apply)
          + key_vault_secret_id = "https://acmedcdcftappsprod.vault.azure.net/secrets/wildcard-platform-hmcts-net"
          + name                = "wildcard-platform-hmcts-net"
          + mpublic_cert_data    = (known after apply)
        }

      + ssl_policy {
          + cipher_suites        = (known after apply)
          + disabled_protocols   = (known after apply)
          + min_protocol_version = (known after apply)
          + policy_name          = (known after apply)
          + policy_type          = (known after apply)
        }
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[0] will be created
  + resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-prod"
      + name                       = "AppGw"
      + target_resource_id         = (known after apply)

      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

  # module.backendappgateway.azurerm_monitor_diagnostic_setting.diagnostic_settings[1] will be created
  + resource "azurerm_monitor_diagnostic_setting" "diagnostic_settings" {
      + id                         = (known after apply)
      + log_analytics_workspace_id = "/subscriptions/8999dec3-0104-4a27-94ee-6588559729d1/resourceGroups/oms-automation/providers/Microsoft.OperationalInsights/workspaces/hmcts-prod"
      + name                       = "AppGw"
      + target_resource_id         = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw"

      + metric {
          + category = (known after apply)
          + enabled  = (known after apply)

          + retention_policy {
              + days    = (known after apply)
              + enabled = (known after apply)
            }
        }
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.backendappgateway.azurerm_application_gateway.ag[1] has changed
  ~ resource "azurerm_application_gateway" "ag" {
        id                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw"
        name                = "cft-aks01-prod-agw"
        tags                = {
            "application"  = "core"
            "builtFrom"    = "hmcts/azure-platform-terraform"
            "businessArea" = "CFT"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (4 unchanged attributes hidden)


      ~ backend_address_pool {
          + fqdns        = []
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/plum-recipe-backend"
            name         = "plum-recipe-backend"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
          + fqdns        = []
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/et-cos"
            name         = "et-cos"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
          + fqdns        = []
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/et-msg-handler"
            name         = "et-msg-handler"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
          + fqdns        = []
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/et-sya-api"
            name         = "et-sya-api"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
          + fqdns        = []
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/ts-translation-service"
            name         = "ts-translation-service"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
          + fqdns        = []
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/ia-bail-case-api"
            name         = "ia-bail-case-api"
            # (1 unchanged attribute hidden)
        }
      ~ backend_address_pool {
          + fqdns        = []
            id           = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendAddressPools/am-judicial-booking-service"
            name         = "am-judicial-booking-service"
            # (1 unchanged attribute hidden)
        }

      ~ backend_http_settings {
            id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendHttpSettingsCollection/plum-recipe-backend"
            name                                = "plum-recipe-backend"
          + trusted_root_certificate_names      = []
            # (7 unchanged attributes hidden)
        }
      ~ backend_http_settings {
            id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendHttpSettingsCollection/et-cos"
            name                                = "et-cos"
          + trusted_root_certificate_names      = []
            # (7 unchanged attributes hidden)
        }
      ~ backend_http_settings {
            id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendHttpSettingsCollection/et-msg-handler"
            name                                = "et-msg-handler"
          + trusted_root_certificate_names      = []
            # (7 unchanged attributes hidden)
        }
      ~ backend_http_settings {
            id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendHttpSettingsCollection/et-sya-api"
            name                                = "et-sya-api"
          + trusted_root_certificate_names      = []
            # (7 unchanged attributes hidden)
        }
      ~ backend_http_settings {
            id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendHttpSettingsCollection/ts-translation-service"
            name                                = "ts-translation-service"
          + trusted_root_certificate_names      = []
            # (7 unchanged attributes hidden)
        }
      ~ backend_http_settings {
            id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendHttpSettingsCollection/ia-bail-case-api"
            name                                = "ia-bail-case-api"
          + trusted_root_certificate_names      = []
            # (7 unchanged attributes hidden)
        }
      ~ backend_http_settings {
            id                                  = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/backendHttpSettingsCollection/am-judicial-booking-service"
            name                                = "am-judicial-booking-service"
          + trusted_root_certificate_names      = []
            # (7 unchanged attributes hidden)
        }




      ~ http_listener {
          + host_names                     = []
            id                             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/httpListeners/plum-recipe-backend"
            name                           = "plum-recipe-backend"
            # (7 unchanged attributes hidden)
        }
      ~ http_listener {
          + host_names                     = []
            id                             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/httpListeners/et-cos"
            name                           = "et-cos"
            # (7 unchanged attributes hidden)
        }
      ~ http_listener {
          + host_names                     = []
            id                             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/httpListeners/et-msg-handler"
            name                           = "et-msg-handler"
            # (7 unchanged attributes hidden)
        }
      ~ http_listener {
          + host_names                     = []
            id                             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/httpListeners/et-sya-api"
            name                           = "et-sya-api"
            # (7 unchanged attributes hidden)
        }
      ~ http_listener {
          + host_names                     = []
            id                             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/httpListeners/ts-translation-service"
            name                           = "ts-translation-service"
            # (7 unchanged attributes hidden)
        }
      ~ http_listener {
          + host_names                     = []
            id                             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/httpListeners/ia-bail-case-api"
            name                           = "ia-bail-case-api"
            # (7 unchanged attributes hidden)
        }
      ~ http_listener {
          + host_names                     = []
            id                             = "/subscriptions/8cbc6f36-7c56-4963-9d36-739db5d00b27/resourceGroups/cft-prod-network-rg/providers/Microsoft.Network/applicationGateways/cft-aks01-prod-agw/httpListeners/am-judicial-booking-service"
            name                           = "am-judicial-booking-service"
            # (7 unchanged attributes hidden)
        }






        # (24 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":1308,"Program":"tfcmt","SHA1":"","Target":"prod-backendappgateway","Vars":{}} -->